app/controllers/pedals_controller.rb

SELECT "pedals".* FROM "pedals"
---
    def index
        pedals = Pedal.all

INSERT INTO "pedals" ("name", "effect_type", "price", "stereo", "number_of_inputs", "number_of_outputs", "image", "category", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
    def create
        pedal = Pedal.create(pedal_params)